ZhaoChaoHua/Gimbal/STM32Code/apps/Function/attitude_filter.cpp
#include "attitude_filter.h"
#include "stm32f40x_define.h"
#include "att2mot.h"

#define CLAMP(x , min , max) ((x) > (max) ? (max) : ((x) < (min) ? (min) : x))
//---------------------------------------------------------------------------------------------------
// table of user settable parameters
const AP_Param::GroupInfo Madgwick::var_info[] PROGMEM =
{
		AP_GROUPINFO("M_P", 0, Madgwick, beta ,0.005),
    
		AP_GROUPEND
};

// 梯度下降姿态解算
Madgwick::Madgwick(float bt)
{
    // 采样频率初始化
    this->beta = bt;
		// 四元数初始化
    this->q0 = 1.0f;
    this->q1 = 0.0f;
    this->q2 = 0.0f;
    this->q3 = 0.0f;    
	  
	  this->calibration_done = false;
}


float Madgwick::invSqrt(float x)
{
	return 1.0f / sqrtf(x);
}

//void cal_Jtf(float* J, float *f, float *df)
//{
//	float t;
//	for(int i = 0; i < 4; i++)
//	{
//		df[i] = 0;
//		for(int j = 0; j < 6; j++)
//		{
//			df[i] += J[i*4+j]*f[j];
//			t = df[i];
//		}
//	}
//}


int scop_beta_rt; 
// 梯度下降算法
void Madgwick::MadgwickUpdate(float gx, float gy, float gz, float ax, float ay, float az, float mx, float my, float mz) 
{
    float recipNorm;
	float s0, s1, s2, s3;
	float qDot1, qDot2, qDot3, qDot4;
	float hx, hy;
//	float q_1, q_2, q_3, q_4, q11, q12, q13, q14, q22, q23, q24, q33, q34, q44, _2q1, _2q2, _2q3, _2q4;
  float _2q0mx, _2q0my, _2q0mz, _2q1mx, _2bx, _2bz, _4bx, _4bz, _2q0, _2q1, _2q2, _2q3, _2q0q2, _2q2q3, q0q0, q0q1, q0q2, q0q3, q1q1, q1q2, q1q3, q2q2, q2q3, q3q3;

	if((mx == 0.0f) && (my == 0.0f) && (mz == 0.0f)) {
//		MadgwickUpdate(gx, gy, gz, ax, ay, az);
		return;
	}
	
	float beta_0 = 10.0f;
	int cal_time = 300;
	static int beta_0_time = cal_time;
	if(beta_0_time > 0) beta_0_time--;
	
  static uint32_t tnow, tPrev;
	float dt;
  uint32_t count;
	
//	float Jt[24], f[6], delta_f[4];
   

    
	// Use IMU algorithm if magnetometer measurement invalid (avoids NaN in magnetometer normalisation)
	if((mx == 0.0f) && (my == 0.0f) && (mz == 0.0f)) {
		MadgwickUpdate(gx, gy, gz, ax, ay, az);
		return;
	}
//	ax *= -1.0f;
//	ay *= -1.0f;
//	az *= -1.0f;
//	mx *= -1.0f;
//	my *= -1.0f;
//	mz *= -1.0f;

	// Rate of change of quaternion from gyroscope
	qDot1 = 0.5f * (-q1 * gx - q2 * gy - q3 * gz);
	qDot2 = 0.5f * (q0 * gx + q2 * gz - q3 * gy);
	qDot3 = 0.5f * (q0 * gy - q1 * gz + q3 * gx);
	qDot4 = 0.5f * (q0 * gz + q1 * gy - q2 * gx);

	// Compute feedback only if accelerometer measurement valid (avoids NaN in accelerometer normalisation)
	if(!((ax == 0.0f) && (ay == 0.0f) && (az == 0.0f))) 
    {
		// Normalise accelerometer measurement
		recipNorm = sqrtf(ax * ax + ay * ay + az * az);
        if(recipNorm == 0)
            return;
        recipNorm = 1.0f/recipNorm;
		ax *= recipNorm;
		ay *= recipNorm;
		az *= recipNorm;

		// Normalise magnetometer measurement
		recipNorm = sqrtf(mx * mx + my * my + mz * mz);
        if(recipNorm == 0)
            return;
        recipNorm = 1.0f/recipNorm;
		mx *= recipNorm;
		my *= recipNorm;
		mz *= recipNorm;


		// Auxiliary variables to avoid repeated arithmetic
		_2q0mx = 2.0f * q0 * mx;
		_2q0my = 2.0f * q0 * my;
		_2q0mz = 2.0f * q0 * mz;
		_2q1mx = 2.0f * q1 * mx;
		_2q0 = 2.0f * q0;
		_2q1 = 2.0f * q1;
		_2q2 = 2.0f * q2;
		_2q3 = 2.0f * q3;
		_2q0q2 = 2.0f * q0 * q2;
		_2q2q3 = 2.0f * q2 * q3;
		q0q0 = q0 * q0;
		q0q1 = q0 * q1;
		q0q2 = q0 * q2;
		q0q3 = q0 * q3;
		q1q1 = q1 * q1;
		q1q2 = q1 * q2;
		q1q3 = q1 * q3;
		q2q2 = q2 * q2;
		q2q3 = q2 * q3;
		q3q3 = q3 * q3;
				
		// Reference direction of Earth's magnetic field
		hx = mx * q0q0 - _2q0my * q3 + _2q0mz * q2 + mx * q1q1 + _2q1 * my * q2 + _2q1 * mz * q3 - mx * q2q2 - mx * q3q3;
		hy = _2q0mx * q3 + my * q0q0 - _2q0mz * q1 + _2q1mx * q2 - my * q1q1 + my * q2q2 + _2q2 * mz * q3 - my * q3q3;
		_2bx = sqrt(hx * hx + hy * hy);
		_2bz = -_2q0mx * q2 + _2q0my * q1 + mz * q0q0 + _2q1mx * q3 - mz * q1q1 + _2q2 * my * q3 - mz * q2q2 + mz * q3q3;
		_4bx = 2.0f * _2bx;
		_4bz = 2.0f * _2bz;

		// Gradient decent algorithm corrective step
		s0 = -_2q2 * (2.0f * q1q3 - _2q0q2 - ax) + _2q1 * (2.0f * q0q1 + _2q2q3 - ay) - _2bz * q2 * (_2bx * (0.5f - q2q2 - q3q3) + _2bz * (q1q3 - q0q2) - mx) + (-_2bx * q3 + _2bz * q1) * (_2bx * (q1q2 - q0q3) + _2bz * (q0q1 + q2q3) - my) + _2bx * q2 * (_2bx * (q0q2 + q1q3) + _2bz * (0.5f - q1q1 - q2q2) - mz);
		s1 = _2q3 * (2.0f * q1q3 - _2q0q2 - ax) + _2q0 * (2.0f * q0q1 + _2q2q3 - ay) - 4.0f * q1 * (1 - 2.0f * q1q1 - 2.0f * q2q2 - az) + _2bz * q3 * (_2bx * (0.5f - q2q2 - q3q3) + _2bz * (q1q3 - q0q2) - mx) + (_2bx * q2 + _2bz * q0) * (_2bx * (q1q2 - q0q3) + _2bz * (q0q1 + q2q3) - my) + (_2bx * q3 - _4bz * q1) * (_2bx * (q0q2 + q1q3) + _2bz * (0.5f - q1q1 - q2q2) - mz);
		s2 = -_2q0 * (2.0f * q1q3 - _2q0q2 - ax) + _2q3 * (2.0f * q0q1 + _2q2q3 - ay) - 4.0f * q2 * (1 - 2.0f * q1q1 - 2.0f * q2q2 - az) + (-_4bx * q2 - _2bz * q0) * (_2bx * (0.5f - q2q2 - q3q3) + _2bz * (q1q3 - q0q2) - mx) + (_2bx * q1 + _2bz * q3) * (_2bx * (q1q2 - q0q3) + _2bz * (q0q1 + q2q3) - my) + (_2bx * q0 - _4bz * q2) * (_2bx * (q0q2 + q1q3) + _2bz * (0.5f - q1q1 - q2q2) - mz);
		s3 = _2q1 * (2.0f * q1q3 - _2q0q2 - ax) + _2q2 * (2.0f * q0q1 + _2q2q3 - ay) + (-_4bx * q3 + _2bz * q1) * (_2bx * (0.5f - q2q2 - q3q3) + _2bz * (q1q3 - q0q2) - mx) + (-_2bx * q0 + _2bz * q2) * (_2bx * (q1q2 - q0q3) + _2bz * (q0q1 + q2q3) - my) + _2bx * q1 * (_2bx * (q0q2 + q1q3) + _2bz * (0.5f - q1q1 - q2q2) - mz);
		recipNorm = invSqrt(s0 * s0 + s1 * s1 + s2 * s2 + s3 * s3); // normalise step magnitude
		s0 *= recipNorm;
		s1 *= recipNorm;
		s2 *= recipNorm;
		s3 *= recipNorm;
				
		// Apply feedback step
	if(beta_0_time > 0)
		{
			float k = ((float)beta_0_time)/((float)cal_time);
			float b = beta_0*k +beta*(1-k);
			scop_beta_rt = b*10000;
			qDot1 -= b * s0;
			qDot2 -= b * s1;
			qDot3 -= b * s2;
			qDot4 -= b * s3;
		}
		else
		{
			if(!calibration_done) calibration_done = true;
			float norm_range = 17;
			float beta_conj = beta*(1 - acc_norm / norm_range);//9.81f*beta/acc_norm;
			if(beta_conj < 0.0001) beta_conj = 0.0001;
			scop_beta_rt = beta_conj * 10000;
			qDot1 -= beta_conj * s0;
			qDot2 -= beta_conj * s1;
			qDot3 -= beta_conj * s2;
			qDot4 -= beta_conj * s3;
		}
	}
		
	// Integrate rate of change of quaternion to yield quaternion
	
	  tnow = SysTick->VAL;
    count = (tnow > tPrev)?(SysTick->LOAD + tPrev - tnow) : (tPrev - tnow);
    dt = count / US_T;
    dt = dt / 1000000.0f;
    tPrev=tnow;
    if(dt < 0.0001f) dt = 0.00025f;

	// Integrate rate of change of quaternion to yield quaternion
	q0 += qDot1 * dt;
	q1 += qDot2 * dt;
	q2 += qDot3 * dt;
	q3 += qDot4 * dt;

	// Normalise quaternion
	recipNorm = sqrtf(q0 * q0 + q1 * q1 + q2 * q2 + q3 * q3);
    if(recipNorm == 0)
        return;
  recipNorm = 1.0f/recipNorm;
	q0 *= recipNorm;
	q1 *= recipNorm;
	q2 *= recipNorm;
	q3 *= recipNorm;
}

//---------------------------------------------------------------------------------------------------
// IMU algorithm update
int scop_beta_time;
int scop_axe, scop_aye, scop_aze, scop_accnorm;
void Madgwick::MadgwickUpdate(float gx, float gy, float gz, float ax, float ay, float az) 
{
	float recipNorm;
	float s0, s1, s2, s3;
	float qDot1, qDot2, qDot3, qDot4;
	float _2q0, _2q1, _2q2, _2q3, _4q0, _4q1, _4q2 ,_8q1, _8q2, q0q0, q1q1, q2q2, q3q3;
	
	// Init beta
	float beta_0 = 10.0f;
	int cal_time = 300;
	static int beta_0_time = cal_time;
	if(beta_0_time > 0) beta_0_time--;
	scop_beta_time = beta_0_time;
	
	static uint32_t tnow, tPrev;
	static float dt;
    uint32_t count;
	
	Vector3f acc_sensor, acc_earth;
	ChMatrix3 dcm;
	dcm.from_quat(q0, q1, q2, q3);
	acc_sensor(ax, ay, az);
	
	acc_earth = mul_vec(&dcm, &acc_sensor);
	acc_earth.z = acc_earth.z - 9.81f;
	acc_norm = 1.0f/invSqrt(acc_earth.x*acc_earth.x + acc_earth.y*acc_earth.y + acc_earth.z*acc_earth.z);
	axe = acc_earth.x;
	aye = acc_earth.y;
	aze = acc_earth.z;
	
	scop_axe = acc_earth.x * 100;
	scop_aye = acc_earth.y * 100;
	scop_aze = acc_earth.z * 100;
  scop_accnorm = acc_norm * 100;
	

	// Rate of change of quaternion from gyroscope
	qDot1 = 0.5f * (-q1 * gx - q2 * gy - q3 * gz);
	qDot2 = 0.5f * (q0 * gx + q2 * gz - q3 * gy);
	qDot3 = 0.5f * (q0 * gy - q1 * gz + q3 * gx);
	qDot4 = 0.5f * (q0 * gz + q1 * gy - q2 * gx);

	// Compute feedback only if accelerometer measurement valid (avoids NaN in accelerometer normalisation)
	if(!((ax == 0.0f) && (ay == 0.0f) && (az == 0.0f))) 
    {
		// Normalise accelerometer measurement
		recipNorm = invSqrt(ax * ax + ay * ay + az * az);
		ax *= recipNorm;
		ay *= recipNorm;
		az *= recipNorm;   

		// Auxiliary variables to avoid repeated arithmetic
		_2q0 = 2.0f * q0;
		_2q1 = 2.0f * q1;
		_2q2 = 2.0f * q2;
		_2q3 = 2.0f * q3;
		_4q0 = 4.0f * q0;
		_4q1 = 4.0f * q1;
		_4q2 = 4.0f * q2;
		_8q1 = 8.0f * q1;
		_8q2 = 8.0f * q2;
		q0q0 = q0 * q0;
		q1q1 = q1 * q1;
		q2q2 = q2 * q2;
		q3q3 = q3 * q3;

		// Gradient decent algorithm corrective step
		s0 = _4q0 * q2q2 + _2q2 * ax + _4q0 * q1q1 - _2q1 * ay;
		s1 = _4q1 * q3q3 - _2q3 * ax + 4.0f * q0q0 * q1 - _2q0 * ay - _4q1 + _8q1 * q1q1 + _8q1 * q2q2 + _4q1 * az;
		s2 = 4.0f * q0q0 * q2 + _2q0 * ax + _4q2 * q3q3 - _2q3 * ay - _4q2 + _8q2 * q1q1 + _8q2 * q2q2 + _4q2 * az;
		s3 = 4.0f * q1q1 * q3 - _2q1 * ax + 4.0f * q2q2 * q3 - _2q2 * ay;
		recipNorm = invSqrt(s0 * s0 + s1 * s1 + s2 * s2 + s3 * s3);
		s0 *= recipNorm;
		s1 *= recipNorm;
		s2 *= recipNorm;
		s3 *= recipNorm;

		// Apply feedback step
		if(beta_0_time > 0)
		{
			float k = ((float)beta_0_time)/((float)cal_time);
			float b = beta_0*k +beta*(1-k);
			scop_beta_rt = b*10000;
			qDot1 -= b * s0;
			qDot2 -= b * s1;
			qDot3 -= b * s2;
			qDot4 -= b * s3;
		}
		else
		{
			if(!calibration_done) calibration_done = true;
			float norm_range = 30;
			float beta_conj = beta*(1 - acc_norm / norm_range);//9.81f*beta/acc_norm;
			if(beta_conj < 0.0001) beta_conj = 0.0001;
			scop_beta_rt = beta_conj * 10000;
			qDot1 -= beta_conj * s0;
			qDot2 -= beta_conj * s1;
			qDot3 -= beta_conj * s2;
			qDot4 -= beta_conj * s3;
		}
	}

	// Integrate rate of change of quaternion to yield quaternion
	
	  tnow = SysTick->VAL;
    count = (tnow > tPrev)?(SysTick->LOAD + tPrev - tnow) : (tPrev - tnow);
    dt = count / US_T;
    dt = dt / 1000000.0f;
    tPrev=tnow;
    if(dt < 0.0001f) dt = 0.00025f;
    
	q0 += qDot1 * dt;
	q1 += qDot2 * dt;
	q2 += qDot3 * dt;
	q3 += qDot4 * dt;

	// Normalise quaternion
	recipNorm = invSqrt(q0 * q0 + q1 * q1 + q2 * q2 + q3 * q3);
	q0 *= recipNorm;
	q1 *= recipNorm;
	q2 *= recipNorm;
	q3 *= recipNorm;
}

int af_scop_roll, af_scop_pitch, af_scop_yaw;
int af_scop_w, af_scop_x, af_scop_y, af_scop_z;
int af_xx, af_yy, af_zz, af_ww;
int af_tt, af_ss;
// 重要:求解欧拉角注意旋转矩阵方向
void Madgwick::getEuler(Vector3f *eular, Vector3f *rad)
{   
	float w, x, y, z;
	w = q0;
	x = -q1;
	y = -q2;
	z = -q3;
	

//	rad->x = atan2f(2*(q2*q3+q0*q1), (q0*q0-q1*q1-q2*q2+q3*q3));
//	rad->y = asinf(-2*(q1*q3-q0*q2));
//	rad->z = atan2f(2*(q1*q2+q0*q3), (q0*q0+q1*q1-q2*q2-q3*q3));
	
	// ROT(Z,X,Y) rotation frame
	rad->x = asinf(2*(y*z-w*x));
	rad->y = atan2f(-2*(x*z+w*y), 2*w*w-1+2*z*z);
	rad->z = atan2f(-2*(x*y+w*z), 2*w*w-1+2*y*y);
	
//	// ROT(Z,X,Y) fix frame
//	rad->x = asinf(-2*(y*z+w*x));
//	rad->y = atan2f(2*(x*z-w*y), 2*w*w-1+2*z*z);
//	rad->z = atan2f(2*(x*y-w*z), 2*w*w-1+2*y*y);

  eular->x = rad->x * RAD_TO_DEG;
  eular->y = rad->y * RAD_TO_DEG;
  eular->z = rad->z * RAD_TO_DEG;
	
	af_scop_roll = (int)(100*eular->x);
	af_scop_pitch = (int)(100*eular->y);
	af_scop_yaw = (int)(100*eular->z);
	
	af_scop_w = q0*1000;
	af_scop_x = q1*1000;
	af_scop_y = q2*1000;
	af_scop_z = q3*1000;
}

/* -------------------------------------------------------------------------- */
/*                                  Mahony                                    */
/* -------------------------------------------------------------------------- */
// table of user settable parameters
const AP_Param::GroupInfo MahonyAHRS::var_info[] PROGMEM =
{
		AP_GROUPINFO("M_P", 0, MahonyAHRS, Kp ,0.8),
	
		AP_GROUPINFO("M_I", 1, MahonyAHRS, Ki ,0.05),
    
		AP_GROUPEND
};

float MahonyAHRS::invSqrt(float x)
{
    return 1.0f / sqrtf(x);
}

float MahonyAHRS::atan2_approx(float y, float x)
{
    #define atanPolyCoef1  3.14551665884836e-07f
    #define atanPolyCoef2  0.99997356613987f
    #define atanPolyCoef3  0.14744007058297684f
    #define atanPolyCoef4  0.3099814292351353f
    #define atanPolyCoef5  0.05030176425872175f
    #define atanPolyCoef6  0.1471039133652469f
    #define atanPolyCoef7  0.6444640676891548f

    float res, absX, absY;
    absX = fabsf(x);
    absY = fabsf(y);
    res  = MAX(absX, absY);
    if (res) res = MIN(absX, absY) / res;
    else res = 0.0f;
    res = -((((atanPolyCoef5 * res - atanPolyCoef4) * res - atanPolyCoef3) * res - atanPolyCoef2) * res - atanPolyCoef1) / ((atanPolyCoef7 * res + atanPolyCoef6) * res + 1.0f);
    if (absY > absX) res = (PI / 2.0f) - res;
    if (x < 0) res = PI - res;
    if (y < 0) res = -res;
    return res;
}

float MahonyAHRS::sin_approx(float x)
{
#define sinPolyCoef3 -1.666665710e-1f                                          // Double: -1.666665709650470145824129400050267289858e-1
#define sinPolyCoef5  8.333017292e-3f                                          // Double:  8.333017291562218127986291618761571373087e-3
#define sinPolyCoef7 -1.980661520e-4f                                          // Double: -1.980661520135080504411629636078917643846e-4
#define sinPolyCoef9  2.600054768e-6f                                          // Double:  2.600054767890361277123254766503271638682e-6
    int32_t xint = x;
    if (xint < -32 || xint > 32) return 0.0f;                     // Stop here on error input (5 * 360 Deg)
    while (x >  PI) x -= (2.0f * PI);                             // always wrap input angle to -PI..PI
    while (x < -PI) x += (2.0f * PI);
    if (x >  (0.5f * PI)) x =  (0.5f * PI) - (x - (0.5f * PI));   // We just pick -90..+90 Degree
    else if (x < -(0.5f * PI)) x = -(0.5f * PI) - ((0.5f * PI) + x);
    float x2 = x * x;
    return x + x * x2 * (sinPolyCoef3 + x2 * (sinPolyCoef5 + x2 * (sinPolyCoef7 + x2 * sinPolyCoef9)));
}

#define DEGREES_TO_DECIDEGREES(angle) (angle * 10)
#define DECIDEGREES_TO_DEGREES(angle) (angle / 10)
#define DECIDEGREES_TO_RADIANS(angle) ((angle / 10.0f) * 0.0174532925f)
#define DEGREES_TO_RADIANS(angle) ((angle) * 0.0174532925f)

float MahonyAHRS::acos_approx(float x)
{
    float xa = fabsf(x);
    float result = sqrtf(1.0f - xa) * (1.5707288f + xa * (-0.2121144f + xa * (0.0742610f + (-0.0187293f * xa))));
    if (x < 0.0f)
        return PI - result;
    else
        return result;
}

MahonyAHRS::MahonyAHRS(float kp, float ki)
{
	q0 = 1.0f;
	q1=q2=q3 = 0.0f;
	
	Kp = kp;
	Ki = ki;
	
	accTimeSum = 0;
	accSumCount = 0;
}

void MahonyAHRS::MahonyAHRSUpdate(float gx, float gy, float gz,  float ax, float ay, float az,  float yawError)
{
    static float integralFBx = 0.0f,  integralFBy = 0.0f, integralFBz = 0.0f;
	
    float recipNorm;	// 
	static uint32_t tnow, tPrev;
	float dt;
    uint32_t count;
	
    //float hx, hy, bx;
    float vx,vy,vz;
    float ex = 0, ey = 0, ez = 0;
    
	float qa, qb, qc;
    
	tnow = SysTick->VAL;
    count = (tnow > tPrev)?(SysTick->LOAD + tPrev - tnow) : (tPrev - tnow);
    dt = count / US_T;
    dt = dt / 1000000.0f;
    tPrev=tnow;
    if(dt < 0.0001f)
    {
        dt = 0.00025f;
    }
    yawError = To_180_degrees(yawError);
    //
    float spin_rate = sqrtf(sq(gx) + sq(gy) + sq(gz));
    
    // yaw
	while (yawError >  PI) yawError -= (2.0f * PI);
	while (yawError < -PI) yawError += (2.0f * PI);
	ez += sin_approx(yawError / 2.0f);

	vx = 2*(q1*q3 - q0*q2);
	vy = 2*(q0*q1 + q2*q3);
	vz = q0*q0 - q1*q1 - q2*q2 + q3*q3;
	
	/* ---------------------------------------------------------------------- */
    recipNorm = sq(ax) + sq(ay) + sq(az);
    if (recipNorm > 0.01f) {
        
        recipNorm = invSqrt(recipNorm);
		
        ax *= recipNorm;
        ay *= recipNorm;
        az *= recipNorm;

		ex = (ay*vz - az*vy);
		ey = (az*vx - ax*vz);
		//ez += (ax*vy - ay*vx);
		
    }
	
	/* ---------------------------------------------------------------------- */
#define SPIN_RATE_LIMIT 20
    
    if(Ki > 0.0f) {
        
        if (spin_rate < DEGREES_TO_RADIANS(SPIN_RATE_LIMIT))
		{
			float dcmKiGain = Ki;
			
            integralFBx += dcmKiGain * ex * dt;
            integralFBy += dcmKiGain * ey * dt;
            integralFBz += dcmKiGain * ez * dt;
        }
    }
    else
	{
        integralFBx = 0.0f;
        integralFBy = 0.0f;
        integralFBz = 0.0f;
    }

	float dcmKpGain = Kp;

    gx += dcmKpGain * ex + integralFBx;
    gy += dcmKpGain * ey + integralFBy;
    gz += dcmKpGain * ez + integralFBz;

    gx *= (0.5f * dt);
    gy *= (0.5f * dt);
    gz *= (0.5f * dt);

    qa = q0;
    qb = q1;
    qc = q2;
    q0 += (-qb * gx - qc * gy - q3 * gz);
    q1 += (qa * gx + qc * gz - q3 * gy);
    q2 += (qa * gy - qb * gz + q3 * gx);
    q3 += (qa * gz + qb * gy - qc * gx);

    recipNorm = invSqrt(sq(q0) + sq(q1) + sq(q2) + sq(q3));
    q0 *= recipNorm;
    q1 *= recipNorm;
    q2 *= recipNorm;
    q3 *= recipNorm;
}

void MahonyAHRS::request_eular(Vector3f *eular, Vector3f *rad)
{
	rad->y = atan2f(2*(q2*q3+q0*q1), (q0*q0-q1*q1-q2*q2+q3*q3));
	rad->x = asinf(-2*(q1*q3-q0*q2));
	rad->z = atan2f(2*(q1*q2+q0*q3), (q0*q0+q1*q1-q2*q2-q3*q3));

  eular->x = rad->x * RAD_TO_DEG;
  eular->y = rad->y * RAD_TO_DEG;
  eular->z = rad->z * RAD_TO_DEG;
	
	af_scop_roll = (int)(100*eular->x);
	af_scop_pitch = (int)(100*eular->y);
	af_scop_yaw = (int)(100*eular->z);
	
	af_scop_w = q0*1000;
	af_scop_x = q1*1000;
	af_scop_y = q2*1000;
	af_scop_z = q3*1000;
}

int32_t applyDeadband(int32_t value, int32_t deadband)
{
    if (ABS(value) < deadband) {
        value = 0;
    } else if (value > 0) {
        value -= deadband;
    } else if (value < 0) {
        value += deadband;
    }
    return value;
}

void MahonyAHRS::BodyToEarth(t_fp_vector * v)
{
    float x,y,z;

    /* From body frame to earth frame */
    x = rMat[0][0] * v->V.X + rMat[0][1] * v->V.Y + rMat[0][2] * v->V.Z;
    y = rMat[1][0] * v->V.X + rMat[1][1] * v->V.Y + rMat[1][2] * v->V.Z;
    z = rMat[2][0] * v->V.X + rMat[2][1] * v->V.Y + rMat[2][2] * v->V.Z;

    v->V.X = x;
    v->V.Y = -y;
    v->V.Z = z;
}

float MahonyAHRS::To_180_degrees(float x)
{
	return (x>180?(x-360):(x<-180?(x+360):x));
}

